INSERT INTO viewset_order (Order_ID, Order_Time, Customer_ID_id, Order_Destination)
VALUES
    (1, '2023-05-23 17:23', 4, '北京市海淀区中关村大街1号'),
    (2, '2023-05-23 18:45', 6, '北京市朝阳区建国路93号'),
    (3, '2023-05-23 19:12', 8, '北京市东城区王府井大街255号'),
    (4, '2023-05-23 20:59', 4, '北京市西城区西单北大街131号'),
    (5, '2023-05-23 21:30', 25, '北京市海淀区中关村南大街27号'),
    (6, '2023-05-23 22:01', 30, '北京市丰台区南四环西路188号'),
    (7, '2023-05-23 23:55', 2, '北京市石景山区古城南路19号'),
    (8, '2023-05-24 00:13', 8, '北京市通州区新华南路1号'),
    (9, '2023-05-24 01:59', 29, '北京市顺义区天竺镇新竹路1号'),
    (10,'2023-05-24 02:30',13,'北京市房山区长阳镇长阳路1号'),
    (11,'2023-05-24 03:45',28,'北京市密云区鼓楼东大街1号'),
    (12,'2023-05-24 04:30',12,'北京市怀柔区雁栖镇雁栖湖南路1号'),
    (13,'2023-05-24 06:00',7,'北京市延庆区康庄镇康庄大街1号'),
    (14,'2023-05-24 07:30',21,'北京市平谷区平谷镇新华街1号'),
	(15,'2023-05-24 08:48',3,'北京市大兴区黄村镇黄村中路1号'),
    (16,'2023-05-24 09:12',5,'北京市怀柔区怀北镇怀柔路1号'),
    (17,'2023-05-24 10:01',1,'北京市密云区溪翁庄镇溪翁庄路1号'),
    (18,'2023-05-24 11:03',17,'北京市平谷区金海湖镇金海湖大街1号'),
    (19,'2023-05-24 12:12',24,'北京市延庆区龙庆峡镇龙庆峡大街1号'),
    (20,'2023-05-24 13:25',26,'北京市朝阳区建国路93号');

INSERT INTO viewset_orderdetail (OrderDetail_ID, ProductBatch_ID_id, Order_ID_id, Quantity, SalePrice)
VALUES
(1, 5, 1, 3.45, 6.78),
(2, 8, 1, 2.84, 4.56),
(3, 15, 2, 4.46, 7.89),
(4, 22, 3, 1.13, 2.34),
(5, 11, 4, 6.38, 6.55),
(6, 17, 4, 5.60, 8.90),
(7, 9, 5, 4.42, 6.54),
(8, 23, 6, 3.81, 4.32),
(9, 4, 6, 2.10, 3.21),
(10, 19, 7, 5.10, 6.32),
(11, 7, 7, 1.98, 2.76),
(12, 13, 8, 3.87, 5.43),
(13, 21, 8, 2.65, 3.98),
(14, 10, 8, 4.54, 2.76),
(15, 18, 8, 8.21, 10.42),
(16, 3, 9, 1.09, 1.65),
(17, 16, 9, 2.98, 4.32),
(18, 24, 10, 3.87, 5.43),
(19, 3, 10, 2.76, 3.98),
(20, 6, 11, 3.65, 5.43),
(21, 12, 11, 4.32, 6.54),
(22, 9, 12, 3.61, 4.66),
(23, 11, 12, 0.32, 6.84),
(24, 8, 13, 3.21, 4.76),
(25, 16, 13, 4.89, 10.23),
(26, 9, 14, 8.90, 11.34),
(27, 3, 15, 7.01, 2.45),
(28, 7, 16, 1.03, 2.34),
(29,14 ,16 ,2.34 ,3.45),
(30 ,15 ,17 ,0.45 ,5.50),
(31 ,4 ,18 ,4.56 ,5.67),
(32 ,17 ,19 ,5.07 ,8.78),
(33 ,8 ,20 ,6.88 ,7.84);

INSERT INTO viewset_delivery (Delivery_ID, Order_ID_id, Dispatcher_ID_id, Vehicle_ID_id, Current_Status, Current_Position, Completion_Time)  
-- Current_Status==0,则没有Current_Position，或者Current_Position就是Order.Order_Destination（约束？）
VALUES
(1, 1, 15, 6, 2,'北京市海淀区中关村大街1号', '2023-05-23 19:23'),
(2, 2, 7, 3, 2,'北京市朝阳区建国路93号', '2023-05-23 21:45'),
(3, 3, 4, 2, 2,'北京市东城区王府井大街255号', '2023-05-23 22:10'),
(4, 4, 5, 1, 2,'北京市西城区西单北大街131号', '2023-05-23 22:30'),
(5, 5, 15, 6, 2,'北京市海淀区中关村南大街27号', '2023-05-23 23:50'),
(6, 6, 5, 1, 2,'北京市丰台区南四环西路188号', '2023-05-23 23:55');

INSERT INTO viewset_delivery (Delivery_ID, Order_ID_id, Dispatcher_ID_id, Vehicle_ID_id, Current_Status, Current_Position)  
-- --Current_Status==1,则没有Completion_Time
VALUES
(7, 7, 4, 12, 1,'北京市门头沟区永定镇永定路1号'),
(8, 8, 20,10, 1,'北京市房山区长阳镇迎风街8号'),
(9, 9, 1, 8, 1,'北京市大兴区黄村镇黄村西大街1号'),
(10,10 ,2 ,16 ,1,'北京市通州区新华大街88号'),
(11 ,11 ,5, 1, 1,'北京市顺义区天竺镇天竺中街1号'),
(12 ,12 ,18 ,17 ,1,'北京市昌平区回龙观镇龙华园一区1号'),
(13 ,13 ,11 ,18 ,1,'北京市怀柔区雁栖镇雁栖湖北路1号'),
(14 ,14 ,11 ,18 ,1,'北京市平谷区金海湖镇金海湖路1号'),
(15 ,15 ,11 ,18 ,1,'北京市密云区鼓楼东大街1号'),
(16 ,16 ,7 ,20 ,1,'北京市延庆区康庄镇康庄路1号');

INSERT INTO viewset_delivery (Delivery_ID, Order_ID_id, Dispatcher_ID_id, Vehicle_ID_id, Current_Status, Current_Position)  
-- --Current_Status==2,则没有Current_Position，或者Current_Position就是仓库位置，但是我根据订单又不知道仓库位置在哪。。所以认为没有Current_Position；当然，也没有Completion_Time
VALUES
(17 ,17 ,15, 6, 0, '北京市顺义区天竺镇新龙西路18号'),
(18 ,18 ,7, 3, 0, '北京市昌平区南口镇回龙观东大街2号'),
(19 ,19 ,5, 1, 0, '北京市昌平区沙河镇北清路8号'),
(20 ,20 ,20,10, 0, '天津市滨海新区塘沽街道海河东路10号');
-- --注意Dispatcher_ID, Vehicle_ID,的组合其实可能在一天内不太会变的